#include <iostream>

using namespace std;

int main()
{
	setlocale(LC_ALL, "rus");

	cout << "ТЕСТ ПО ИСТОРИИ" << endl << endl;

	int a = 0;	//Переменная 
	int b = 0;	//Переменная оценки
	int count = 1; //Пересенная попыток


	cout << "В каком году произошло восстание в Праге?" << endl;   // 1 вопрос
	cin >> a;

	if (a == 1419) {
		cout << "ОТВЕТ ВЕРНЫЙ" << endl;
		b++;
	}

	else {
		cout << "ОТВЕТ НЕ ВЕРНЫЙ" << endl;

		while (a != 1419 && count < 3) {
			count++;
			cout << "Повторите попытку: " << endl;
			cin >> a;
			if (a == 1419) {
				cout << "Ответ верный" << endl;
				b++;
			}
		}
	}

	//////////////////////////////////////////////////////////////////////////////   

	cout << "В каком году Россия стала империей?" << endl; // 2 вопрос
	a = 0;
	cin >> a;
	count = 1;

	if (a == 1721) {
		cout << "ОТВЕТ ВЕРНЫЙ" << endl;
		b++;
	}

	else {
		cout << "ОТВЕТ НЕ ВЕРНЫЙ" << endl;

		while (a != 1721 && count < 3) {
			count++;
			cout << "Повторите попытку: " << endl;
			cin >> a;
			if (a == 1721) {
				cout << "Ответ верный" << endl;
				b++;
			}
		}
	}

	/////////////////////////////////////////////////////////////////////////////////        

	cout << "В каком году Александр I вступил на престол?" << endl; // 3 вопрос
	a = 0;
	cin >> a;
	count = 1;

	if (a == 1801) {
		cout << "ОТВЕТ ВЕРНЫЙ" << endl;
		b++;
	}

	else {
		cout << "ОТВЕТ НЕ ВЕРНЫЙ" << endl;

		while (a != 1801 && count < 3) {
			count++;
			cout << "Повторите попытку: " << endl;
			cin >> a;
			if (a == 1801) {
				cout << "Ответ верный" << endl;
				b++;
			}
		}
	}

	/////////////////////////////////////////////////////////////////////////////////        

	cout << "В каком году был издан указ о «урочных летах»?" << endl; // 4 вопрос
	a = 0;
	cin >> a;
	count = 1;

	if (a == 1597) {
		cout << "ОТВЕТ ВЕРНЫЙ" << endl;
		b++;
	}

	else {
		cout << "ОТВЕТ НЕ ВЕРНЫЙ" << endl;

		while (a != 1597 && count < 3) {
			count++;
			cout << "Повторите попытку: " << endl;
			cin >> a;
			if (a == 1597) {
				cout << "Ответ верный" << endl;
				b++;
			}
		}
	}

	/////////////////////////////////////////////////////////////////////////////////        

	cout << "Когда произошло образование Чехословацкого государства??" << endl; // 5 вопрос
	a = 0;
	cin >> a;
	count = 1;

	if (a == 1918) {
		cout << "ОТВЕТ ВЕРНЫЙ" << endl;
		b++;
	}

	else {
		cout << "ОТВЕТ НЕ ВЕРНЫЙ" << endl;

		while (a != 1918 && count < 3) {
			count++;
			cout << "Повторите попытку: " << endl;
			cin >> a;
			if (a == 1918) {
				cout << "Ответ верный" << endl;
				b++;
			}
		}
	}

	///////////////////////////////////////////////////////////////////////////////////

	switch (b) {
	case 0:
		if (b == 0) {
			cout << "ВАША ОЦЕНКА: 2" << endl;
		};
	case 1:
		if (b == 1) {
			cout << "ВАША ОЦЕНКА: 2" << endl;
		};
	case 2:
		if (b == 2) {
			cout << "ВАША ОЦЕНКА: 2+" << endl;
		};
	case 3:
		if (b == 3) {
			cout << "ВАША ОЦЕНКА: 3" << endl;
		};
	case 4:
		if (b == 4) {
			cout << "ВАША ОЦЕНКА: 4" << endl;
		};
	case 5:
		if (b == 5) {
			cout << "ВАША ОЦЕНКА: 5" << endl;
		};


	}


	system("pause");
	return 0;
}